{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "pycharm": {}
   },
   "source": [
    "## Summary\n",
    "This Graph ML notebook will utilise Neo4j Native Algorithm to build upon the existing Graph Network,\n",
    "in this follows steps:\n",
    "### 1. Weakly Connected Components GraphML\n",
    "- This is used to identify graph networks that are definitive isolated.\n",
    "\n",
    "### 2. Similarity Algorithm\n",
    "- Look for Similarity between 2 Stored Procedures networks amongst Tables\n",
    "\n",
    "### 3. Community Algorithm (Label Propagation Algorithm)\n",
    "- Using the Similarity Algorithm, to determine the Groupings of Stored Procedures"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### 1. Import Packages & Set Neo4j DB connection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "from IPython import display\n",
    "\n",
    "graph = Graph(\"bolt://localhost:7687\", auth=(\"neo4j\", \"123\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "pycharm": {}
   },
   "source": [
    "The nodes we have:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nodes:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>VIEW</td>\n",
       "      <td>557</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SP</td>\n",
       "      <td>1230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TABLE</td>\n",
       "      <td>3320</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   label  count\n",
       "2   VIEW    557\n",
       "0     SP   1230\n",
       "1  TABLE   3320"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(\"Nodes:\")\n",
    "\n",
    "result = {\"label\": [], \"count\": []}\n",
    "for label in graph.run(\"CALL db.labels()\").to_series():\n",
    "    query = f\"MATCH (:`{label}`) RETURN count(*) as count\"\n",
    "    count = graph.run(query).to_data_frame().iloc[0]['count']\n",
    "    result[\"label\"].append(label)\n",
    "    result[\"count\"].append(count)\n",
    "nodes_df = pd.DataFrame(data=result)\n",
    "nodes_df.sort_values(\"count\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "pycharm": {}
   },
   "source": [
    "The relationships we have:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "pycharm": {}
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relationships:\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>relType</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CALL_SP</td>\n",
       "      <td>121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SP_INSERT_UPDATE</td>\n",
       "      <td>1820</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SP_SELECT_FROM</td>\n",
       "      <td>4380</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>RELY_ON</td>\n",
       "      <td>7049</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            relType  count\n",
       "3           CALL_SP    121\n",
       "1  SP_INSERT_UPDATE   1820\n",
       "2    SP_SELECT_FROM   4380\n",
       "0           RELY_ON   7049"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "print(\"Relationships:\")\n",
    "\n",
    "result = {\"relType\": [], \"count\": []}\n",
    "for relationship_type in graph.run(\"CALL db.relationshipTypes()\").to_series():\n",
    "    query = f\"MATCH ()-[:`{relationship_type}`]->() RETURN count(*) as count\"\n",
    "    count = graph.run(query).to_data_frame().iloc[0]['count']\n",
    "    result[\"relType\"].append(relationship_type)\n",
    "    result[\"count\"].append(count)\n",
    "rels_df = pd.DataFrame(data=result)\n",
    "rels_df.sort_values(\"count\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Graph ML"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 1. WCC : Looking for disjointed paths across segments using GraphML\n",
    "WCC will find all isolated islands, these will form natural community"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running WCC to the main graph---\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodePropertiesWritten</th>\n",
       "      <th>componentCount</th>\n",
       "      <th>componentDistribution</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4503</td>\n",
       "      <td>1919</td>\n",
       "      <td>{'p99': 3, 'min': 1, 'max': 2041, 'mean': 2.34...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   nodePropertiesWritten  componentCount  \\\n",
       "0                   4503            1919   \n",
       "\n",
       "                               componentDistribution  \n",
       "0  {'p99': 3, 'min': 1, 'max': 2041, 'mean': 2.34...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.drop('SP_ML_Graph', false)\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.graph.drop('SP_ML_Graph_v2', false)\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'SP_ML_Graph',\n",
    "    {\n",
    "        SP: {properties: ['EXCLUSION']}, \n",
    "        TABLE: {properties: ['EXCLUSION']}\n",
    "    },\n",
    "    {\n",
    "        REL:{type: 'RELY_ON', orientation:'UNDIRECTED'}\n",
    "    }\n",
    ");\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "query = \"\"\"\n",
    "    CALL gds.beta.graph.project.subgraph(\n",
    "      'SP_ML_Graph_v2', \n",
    "      'SP_ML_Graph', \n",
    "      'n.EXCLUSION=0 OR (n:SP AND n.EXCLUSION=0)', \n",
    "      '*' \n",
    "    )\n",
    "    \"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "query = \"\"\"\n",
    "    CALL gds.wcc.write('SP_ML_Graph_v2',\n",
    "                      {\n",
    "                          writeProperty: 'wcc_group'\n",
    "                      }) YIELD nodePropertiesWritten, componentCount, componentDistribution\n",
    "    \"\"\"\n",
    "print(\"Running WCC to the main graph---\")\n",
    "graph.run(query).to_data_frame()\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### The WCC results\n",
    "Each grouping represents one isolated islands\n",
    "(i.e. countsize = 1 -> the SP utilise TABLES that no other SP uses)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>wcc_group</th>\n",
       "      <th>countsize</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1.0</td>\n",
       "      <td>872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>161.0</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>104.0</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>66.0</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>249</th>\n",
       "      <td>1172.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>250</th>\n",
       "      <td>1173.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>251</th>\n",
       "      <td>1174.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>252</th>\n",
       "      <td>1175.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>253</th>\n",
       "      <td>1176.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>254 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     wcc_group  countsize\n",
       "0          1.0        872\n",
       "1          NaN         45\n",
       "2        161.0         35\n",
       "3        104.0          8\n",
       "4         66.0          6\n",
       "..         ...        ...\n",
       "249     1172.0          1\n",
       "250     1173.0          1\n",
       "251     1174.0          1\n",
       "252     1175.0          1\n",
       "253     1176.0          1\n",
       "\n",
       "[254 rows x 2 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.wcc_group is null\n",
    "SET s.wcc_group_count = 0\n",
    "\"\"\"\n",
    "\n",
    "graph.run(query)\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.wcc_group as wcc_group, size(collect(s.SP_ID)) as countsize\n",
    "return wcc_group, countsize \n",
    "order by countsize desc\n",
    "\"\"\"\n",
    "\n",
    "df =graph.run(query).to_data_frame()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s2.wcc_group</th>\n",
       "      <th>wcc_group_count</th>\n",
       "      <th>wcc_group_wordcount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "      <td>907804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "      <td>907804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "      <td>907804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "      <td>907804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "      <td>907804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1180</th>\n",
       "      <td>1172</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1181</th>\n",
       "      <td>1173</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1182</th>\n",
       "      <td>1174</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1183</th>\n",
       "      <td>1175</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1184</th>\n",
       "      <td>1176</td>\n",
       "      <td>1</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1185 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      s2.wcc_group  wcc_group_count  wcc_group_wordcount\n",
       "0                1              872               907804\n",
       "1                1              872               907804\n",
       "2                1              872               907804\n",
       "3                1              872               907804\n",
       "4                1              872               907804\n",
       "...            ...              ...                  ...\n",
       "1180          1172                1                    0\n",
       "1181          1173                1                    0\n",
       "1182          1174                1                    0\n",
       "1183          1175                1                    0\n",
       "1184          1176                1                    0\n",
       "\n",
       "[1185 rows x 3 columns]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Putting the wcc_group_count and wcc_group_wordcount back into the Node for easier manipulation\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize, SUM(s.SYNTAX_WORDCOUNT) as syntax_wordcount\n",
    "\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.wcc_group_count = countsize,\n",
    "    s2.wcc_group_wordcount = syntax_wordcount\n",
    "return s2.wcc_group, countsize as wcc_group_count, syntax_wordcount as wcc_group_wordcount\n",
    "order by countsize desc\n",
    "\"\"\"\n",
    "\n",
    "df =graph.run(query).to_data_frame()\n",
    "df\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## EDA on the Community built\n",
    "- Community is based on the Weakly Connectyd Components\n",
    "- 99991 : Singleton Group\n",
    "- 99992 : Cluster with 2-9 Nodes\n",
    "- 99993 : Cluster with 11-19 Nodes\n",
    "- 99994 : Cluster with 20-29 Nodes\n",
    "- 99995 : Cluster with 30-39 Nodes\n",
    "- 99999 : SP in the Exclusion List\n",
    "- Anything above 30, they will be assigned their own group"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Exclusion Groups\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.EXCLUSION = 1\n",
    "SET s.final_group = 99999\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#First let group all singleton groups into the same subgroup first\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize = 1\n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = 99991\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#If a wcc group between 2 - 9 counts, then put it in another supgroup\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize >= 2 and countsize <= 10 \n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = 99992\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#If a wcc group between 11 - 19 counts, then put it in another supgroup\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize > 10 and countsize <= 19\n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = 99993\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#If a wcc group between 20 - 29 counts, then put it in another supgroup\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize > 20 and countsize <= 29\n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = 99994\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#If a wcc group between 30 - 39 counts, then put it in another supgroup\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize > 30 and countsize <= 39\n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = 99995\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Any WCC greater than 30 should be treated as single final group\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.wcc_group as wcc_group_select, size(collect(s.SP_ID)) as countsize, s.final_group as final_group\n",
    "where countsize > 30 and final_group is null\n",
    "\n",
    "with wcc_group_select\n",
    "match (s2:SP)\n",
    "where s2.wcc_group = wcc_group_select\n",
    "SET s2.final_group = wcc_group_select\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.final_group</th>\n",
       "      <th>size(collect(s.SP_ID))</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>99991</td>\n",
       "      <td>241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>99992</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>99999</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>99995</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   s.final_group  size(collect(s.SP_ID))\n",
       "0          99991                     241\n",
       "1              1                     872\n",
       "2          99992                      37\n",
       "3          99999                      45\n",
       "4          99995                      35"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "return s.final_group, size(collect(s.SP_ID))\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.wcc_group</th>\n",
       "      <th>size(collect(s.SP_ID))</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1.0</td>\n",
       "      <td>872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>8.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>12.0</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>249</th>\n",
       "      <td>1172.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>250</th>\n",
       "      <td>1173.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>251</th>\n",
       "      <td>1174.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>252</th>\n",
       "      <td>1175.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>253</th>\n",
       "      <td>1176.0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>254 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     s.wcc_group  size(collect(s.SP_ID))\n",
       "0            0.0                       1\n",
       "1            1.0                     872\n",
       "2            8.0                       1\n",
       "3           10.0                       1\n",
       "4           12.0                       5\n",
       "..           ...                     ...\n",
       "249       1172.0                       1\n",
       "250       1173.0                       1\n",
       "251       1174.0                       1\n",
       "252       1175.0                       1\n",
       "253       1176.0                       1\n",
       "\n",
       "[254 rows x 2 columns]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "return s.wcc_group, size(collect(s.SP_ID))\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Community Detection \n",
    "We will utilise 2 community algorithms (Louvain and LPA) and comparing the results\n",
    "\n",
    "Purpose : To see if these big wcc groups can be break down into smaller sup-group with minimal overlapping\n",
    "\n",
    "Default we only running for WCC Groups with more than 40 SPs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nodeProjection</th>\n",
       "      <th>relationshipProjection</th>\n",
       "      <th>graphName</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>relationshipCount</th>\n",
       "      <th>projectMillis</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>{'TABLE': {'label': 'TABLE', 'properties': {'E...</td>\n",
       "      <td>{'REL': {'orientation': 'UNDIRECTED', 'aggrega...</td>\n",
       "      <td>SP_ML_Graph</td>\n",
       "      <td>4550</td>\n",
       "      <td>12380</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                      nodeProjection  \\\n",
       "0  {'TABLE': {'label': 'TABLE', 'properties': {'E...   \n",
       "\n",
       "                              relationshipProjection    graphName  nodeCount  \\\n",
       "0  {'REL': {'orientation': 'UNDIRECTED', 'aggrega...  SP_ML_Graph       4550   \n",
       "\n",
       "   relationshipCount  projectMillis  \n",
       "0              12380             20  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL gds.graph.drop('SP_ML_Graph', false)\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.graph.drop('SP_ML_Graph_sub', false)\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "CALL gds.graph.project(\n",
    "    'SP_ML_Graph',\n",
    "    {\n",
    "        SP: {properties: ['wcc_group_count', 'EXCLUSION']}, \n",
    "        TABLE: {properties: ['EXCLUSION']}\n",
    "    },\n",
    "    {\n",
    "        REL:{type: 'RELY_ON', orientation:'UNDIRECTED'}\n",
    "    }\n",
    ");\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "    Creating Sub-Graphs for the main WCC group only\n",
      "            Running node Similarity : SimilarityCutOff=0.0001, topK=5000\n",
      "            Running Community Detection (louvain)\n",
      "            Running Community Detection (Label Propagation)\n",
      "completed!\n",
      "CPU times: total: 15.6 ms\n",
      "Wall time: 1.78 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "#You can charge it here n.wcc_group_count>=40 to any other numbers\n",
    "query = \"\"\"\n",
    "    CALL gds.beta.graph.project.subgraph(\n",
    "      'SP_ML_Graph_sub', \n",
    "      'SP_ML_Graph', \n",
    "      '(n:SP AND n.wcc_group_count>=40 AND n.EXCLUSION=0) OR (n:TABLE AND n.EXCLUSION=0)', \n",
    "      '*' \n",
    "    )\n",
    "    \"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "#print(\"This piece of GraphML applies to only the main group wcc_group=0\")\n",
    "print(\"    Creating Sub-Graphs for the main WCC group only\")\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "    CALL gds.nodeSimilarity.mutate(\n",
    "        'SP_ML_Graph_sub',\n",
    "        {\n",
    "        mutateRelationshipType: 'ML_SP_SIMILAR',\n",
    "        mutateProperty: 'score',\n",
    "        similarityCutoff: 0.0001,\n",
    "        topK: 50000\n",
    "        }\n",
    "    ) YIELD nodesCompared, relationshipsWritten;\n",
    "    \"\"\"\n",
    "print(\"            Running node Similarity : SimilarityCutOff=0.0001, topK=5000\")\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "#Use this to Plug the relationship back into the DB\n",
    "query = \"\"\"\n",
    "    CALL gds.graph.writeRelationship(\n",
    "        'SP_ML_Graph_sub',\n",
    "        'ML_SP_SIMILAR',\n",
    "        'score'\n",
    "    )\n",
    "    \"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "    \n",
    "    \n",
    "print(\"            Running Community Detection (louvain)\")\n",
    "query = \"\"\"\n",
    "    CALL gds.louvain.write(\n",
    "        'SP_ML_Graph_sub',\n",
    "        {\n",
    "        nodeLabels: ['SP'],\n",
    "        relationshipTypes: ['ML_SP_SIMILAR'],\n",
    "        writeProperty: 'louvain_community_group',\n",
    "        relationshipWeightProperty: 'score'\n",
    "        }\n",
    "    ) YIELD modularity, ranLevels, communityCount;\n",
    "    \"\"\"\n",
    "\n",
    "graph.run(query).to_data_frame()\n",
    "    \n",
    "\n",
    "print(\"            Running Community Detection (Label Propagation)\")\n",
    "query = \"\"\"\n",
    "CALL gds.labelPropagation.write('SP_ML_Graph_sub', { writeProperty: 'lpa_community_group' })\n",
    "YIELD communityCount, ranIterations, didConverge\n",
    "    \"\"\"\n",
    "\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "print(\"completed!\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Use this to delete all the Machine Learning SIMILAR relationships amongst SP, since it is redundant\n",
    "\n",
    "query = \"\"\"\n",
    "match (s1:SP)-[t:ML_SP_SIMILAR]-(s2:SP)\n",
    "where s1<>s2\n",
    "delete t\n",
    "\"\"\"\n",
    "\n",
    "df = graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "query = \"\"\"\n",
    "match (t1:TABLE)-[k:ML_SP_SIMILAR]-(t2:TABLE)\n",
    "where t1<>t2\n",
    "delete k\n",
    "\"\"\"\n",
    "\n",
    "df = graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lpa results\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.lpa_community_group</th>\n",
       "      <th>lpa_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>170</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>412</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>515</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>185</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>188</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>244</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>247</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>1181</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>169</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>172</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>679</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    s.lpa_community_group  lpa_count\n",
       "0                       2        718\n",
       "1                     170         39\n",
       "2                     412         33\n",
       "3                     515         18\n",
       "4                     185         14\n",
       "5                     188         14\n",
       "6                     244          9\n",
       "7                     247          9\n",
       "8                    1181          8\n",
       "9                     169          5\n",
       "10                    172          4\n",
       "11                    679          1"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#lpa Results\n",
    "print(\"lpa results\")\n",
    "\n",
    "query = \"\"\"\n",
    "    match(s:SP)\n",
    "    where s.lpa_community_group is not null\n",
    "    return  s.lpa_community_group, size(collect(s.SP_ID)) as lpa_count\n",
    "    order by lpa_count desc\n",
    "    \"\"\"\n",
    "df =graph.run(query).to_data_frame()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "louvain results\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.louvain_community_group</th>\n",
       "      <th>louvain_count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>671</td>\n",
       "      <td>235</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>738</td>\n",
       "      <td>152</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>480</td>\n",
       "      <td>141</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>746</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>271</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>114</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>684</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>116</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>160</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>343</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>805</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>766</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>106</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>588</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>812</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>859</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>619</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>387</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>64</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>422</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>832</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>470</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>785</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>829</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    s.louvain_community_group  louvain_count\n",
       "0                         671            235\n",
       "1                         738            152\n",
       "2                         480            141\n",
       "3                         746             80\n",
       "4                         271             37\n",
       "5                         114             37\n",
       "6                         684             31\n",
       "7                         116             30\n",
       "8                         160             21\n",
       "9                         343             18\n",
       "10                        805             13\n",
       "11                        766             12\n",
       "12                        106              9\n",
       "13                        588              9\n",
       "14                        812              8\n",
       "15                        859              8\n",
       "16                        619              5\n",
       "17                        387              5\n",
       "18                         64              5\n",
       "19                        422              5\n",
       "20                        832              4\n",
       "21                        470              3\n",
       "22                        785              2\n",
       "23                        829              2"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#louvain Results\n",
    "print(\"louvain results\")\n",
    "\n",
    "query = \"\"\"\n",
    "    match(s:SP)\n",
    "    where s.louvain_community_group is not null\n",
    "    return s.louvain_community_group, size(collect(s.SP_ID)) as louvain_count\n",
    "    order by louvain_count desc\n",
    "    \"\"\"\n",
    "df =graph.run(query).to_data_frame()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Return top 10 SP per community\n"
     ]
    }
   ],
   "source": [
    "exploratory_query = \"\"\"\n",
    "//pageRank algorithms\n",
    "\n",
    "MATCH (s:SP)\n",
    "where s.sp_community_group is not null\n",
    "WITH s.sp_community_group as community, count(*) as communitySize, sum(s.SYNTAX_WORDCOUNT) as syntax_wordcount\n",
    "ORDER BY communitySize DESC \n",
    "\n",
    "CALL gds.pageRank.stream(\n",
    "    {nodeQuery: 'MATCH (s:SP) where s.sp_community_group=$community\n",
    "    RETURN id(s) as id', \n",
    "    relationshipQuery: 'MATCH (s1:SP)-[s:ML_SP_SIMILAR]-(s2:SP)\n",
    "    WHERE s1.purchase_community_louvain = $community and s2.purchase_community_louvain = $community\n",
    "    RETURN id(s1) as source, id(s2) as target, s.score as weight',\n",
    "    relationshipWeightProperty: 'weight',\n",
    "    parameters:{community: community}}\n",
    ") YIELD nodeId, score\n",
    "\n",
    "WITH community, communitySize, nodeId, score, syntax_wordcount\n",
    "ORDER BY score DESC\n",
    "RETURN community, communitySize, syntax_wordcount, collect(gds.util.asNode(nodeId).SP_ID)[..10] as community_Name ORDER BY communitySize DESC\n",
    "\"\"\"\n",
    "\n",
    "print(\"Return top 10 SP per community\")\n",
    "#df=graph.run(exploratory_query).to_data_frame()\n",
    "#df\n",
    "#df.to_csv(\"abc.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Downloading the inter-cluster OVERLAPPING results out\n",
    "exploratory_query = \"\"\"\n",
    "MATCH (s1:SP)-[:RELY_ON]->(t:TABLE)<-[:RELY_ON]-(s2:SP)\n",
    "where s1.lpa_community_group<>s2.lpa_community_group and s1.wcc_group = s2.wcc_group\n",
    "return s1.lpa_community_group, s1.SP_ID,  t.TABLE_ID\n",
    "order by t.TABLE_ID\n",
    "\"\"\"\n",
    "\n",
    "df_overlap=graph.run(exploratory_query).to_data_frame()\n",
    "df_overlap\n",
    "df_overlap.to_excel(\"lpa_overlapping.xlsx\")\n",
    "\n",
    "#Downloading the inter-cluster OVERLAPPING results out\n",
    "exploratory_query = \"\"\"\n",
    "MATCH (s1:SP)-[:RELY_ON]->(t:TABLE)<-[:RELY_ON]-(s2:SP)\n",
    "where s1.louvain_community_group<>s2.louvain_community_group and s1.wcc_group = s2.wcc_group\n",
    "return s1.louvain_community_group, s1.SP_ID,  t.TABLE_ID\n",
    "order by t.TABLE_ID\n",
    "\"\"\"\n",
    "\n",
    "df_overlap=graph.run(exploratory_query).to_data_frame()\n",
    "df_overlap\n",
    "df_overlap.to_excel(\"louvain_overlapping.xlsx\")\n",
    "\n",
    "#Downloading all the communities results\n",
    "exploratory_query = \"\"\"\n",
    "MATCH (s:SP)-[:RELY_ON]->(t:TABLE)\n",
    "return s.louvain_community_group, s.lpa_community_group, s.wcc_group, s.SP_ID,  t.TABLE_ID\n",
    "order by t.TABLE_ID\n",
    "\"\"\"\n",
    "\n",
    "df_overlap=graph.run(exploratory_query).to_data_frame()\n",
    "df_overlap\n",
    "df_overlap.to_excel(\"sp_grouping.xlsx\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Downloading all the communities results\n",
    "exploratory_query = \"\"\"\n",
    "MATCH (s:SP)-[:RELY_ON]->(t:TABLE)\n",
    "return s.final_group, s.wcc_group, s.louvain_community_group, s.lpa_community_group, s.SP_ID,  t.TABLE_ID\n",
    "order by t.TABLE_ID\n",
    "\"\"\"\n",
    "\n",
    "df_overlap=graph.run(exploratory_query).to_data_frame()\n",
    "df_overlap\n",
    "df_overlap.to_excel(\"sp_grouping.xlsx\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.final_group</th>\n",
       "      <th>s.wcc_group</th>\n",
       "      <th>s.louvain_community_group</th>\n",
       "      <th>s.lpa_community_group</th>\n",
       "      <th>s.SP_ID</th>\n",
       "      <th>t.TABLE_ID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>116.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.GROUP_DAILY_MANAGEMENT_SP_CAMBODIA</td>\n",
       "      <td>ANALYSE.77_DS_RESHAPE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>160.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.GROUP_DAILY_MGMT_SP_HNB_77</td>\n",
       "      <td>ANALYSE.77_DS_RESHAPE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>671.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW</td>\n",
       "      <td>ANALYSE.77_DS_RESHAPE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>671.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW_V2</td>\n",
       "      <td>ANALYSE.77_DS_RESHAPE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>671.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW_V2_MARGIN</td>\n",
       "      <td>ANALYSE.77_DS_RESHAPE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6185</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>480.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.ANFIELD_TO_LOY_EARN_METRICS</td>\n",
       "      <td>UTIL.ANFIELD_LOY_COMMON_PARAMETERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6186</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>746.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.ANFIELD_TO_LOY_FIRST_EARN_BURN</td>\n",
       "      <td>UTIL.ANFIELD_LOY_COMMON_PARAMETERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6187</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>480.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.ANFIELD_TO_LOY_LOYALTY_IDENTIFIER</td>\n",
       "      <td>UTIL.ANFIELD_LOY_COMMON_PARAMETERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6188</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>480.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.ANFIELD_TO_LOY_MEM_ABNORMAL</td>\n",
       "      <td>UTIL.ANFIELD_LOY_COMMON_PARAMETERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6189</th>\n",
       "      <td>1</td>\n",
       "      <td>1.0</td>\n",
       "      <td>480.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>PUBLISH.ANFIELD_TO_LOY_MEM_ABNORMAL_METRICS</td>\n",
       "      <td>UTIL.ANFIELD_LOY_COMMON_PARAMETERS</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6190 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      s.final_group  s.wcc_group  s.louvain_community_group  \\\n",
       "0                 1          1.0                      116.0   \n",
       "1                 1          1.0                      160.0   \n",
       "2                 1          1.0                      671.0   \n",
       "3                 1          1.0                      671.0   \n",
       "4                 1          1.0                      671.0   \n",
       "...             ...          ...                        ...   \n",
       "6185              1          1.0                      480.0   \n",
       "6186              1          1.0                      746.0   \n",
       "6187              1          1.0                      480.0   \n",
       "6188              1          1.0                      480.0   \n",
       "6189              1          1.0                      480.0   \n",
       "\n",
       "      s.lpa_community_group                                         s.SP_ID  \\\n",
       "0                       2.0      PUBLISH.GROUP_DAILY_MANAGEMENT_SP_CAMBODIA   \n",
       "1                       2.0              PUBLISH.GROUP_DAILY_MGMT_SP_HNB_77   \n",
       "2                       2.0            PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW   \n",
       "3                       2.0         PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW_V2   \n",
       "4                       2.0  PUBLISH.IT_SAP_DATA_CHECK_77_VS_AZDW_V2_MARGIN   \n",
       "...                     ...                                             ...   \n",
       "6185                    2.0             PUBLISH.ANFIELD_TO_LOY_EARN_METRICS   \n",
       "6186                    2.0          PUBLISH.ANFIELD_TO_LOY_FIRST_EARN_BURN   \n",
       "6187                    2.0       PUBLISH.ANFIELD_TO_LOY_LOYALTY_IDENTIFIER   \n",
       "6188                    2.0             PUBLISH.ANFIELD_TO_LOY_MEM_ABNORMAL   \n",
       "6189                    2.0     PUBLISH.ANFIELD_TO_LOY_MEM_ABNORMAL_METRICS   \n",
       "\n",
       "                              t.TABLE_ID  \n",
       "0                  ANALYSE.77_DS_RESHAPE  \n",
       "1                  ANALYSE.77_DS_RESHAPE  \n",
       "2                  ANALYSE.77_DS_RESHAPE  \n",
       "3                  ANALYSE.77_DS_RESHAPE  \n",
       "4                  ANALYSE.77_DS_RESHAPE  \n",
       "...                                  ...  \n",
       "6185  UTIL.ANFIELD_LOY_COMMON_PARAMETERS  \n",
       "6186  UTIL.ANFIELD_LOY_COMMON_PARAMETERS  \n",
       "6187  UTIL.ANFIELD_LOY_COMMON_PARAMETERS  \n",
       "6188  UTIL.ANFIELD_LOY_COMMON_PARAMETERS  \n",
       "6189  UTIL.ANFIELD_LOY_COMMON_PARAMETERS  \n",
       "\n",
       "[6190 rows x 6 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_overlap"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sp_community_group</th>\n",
       "      <th>countsize</th>\n",
       "      <th>wordcounts</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>None</td>\n",
       "      <td>1230</td>\n",
       "      <td>1058851</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  sp_community_group  countsize  wordcounts\n",
       "0               None       1230     1058851"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "where s.sp_community_group is null\n",
    "return s.sp_community_group as sp_community_group, size(collect(s.SP_ID)) as countsize, sum(s.SYNTAX_WORDCOUNT) as wordcounts\n",
    "    \"\"\"\n",
    "df =graph.run(query).to_data_frame()\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Check if have nested SP:\n",
      "SP Calling SP (x1) :\n",
      "<bound method Cursor.to_data_frame of  count(*) \n",
      "----------\n",
      "      121 \n",
      ">\n",
      "SP Calling SP Calling SP (x2) :\n",
      "   countsize\n",
      "0         22\n",
      "Nested SP should have lower priority\n",
      "            If an SP calls another SP, then the SP with dependencies should be worked on first\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match r1=(s1:SP)-[:CALL_SP]->(s2:SP)-[:CALL_SP]->(s3:SP)\n",
    "where s1<>s2 and s2<>s3 and s3<>s1\n",
    "return r1\n",
    "\"\"\"\n",
    "df =graph.run(query).to_data_frame()\n",
    "\n",
    "print(\"Check if have nested SP:\")\n",
    "\n",
    "print(\"SP Calling SP (x1) :\")\n",
    "query = \"\"\"\n",
    "match r1=(s1:SP)-[:CALL_SP]->(s2:SP)\n",
    "where s1<>s2\n",
    "return count(*)\n",
    "\"\"\"\n",
    "df =graph.run(query).to_data_frame\n",
    "print(df)\n",
    "\n",
    "print(\"SP Calling SP Calling SP (x2) :\")\n",
    "query = \"\"\"\n",
    "match r1=(s1:SP)-[:CALL_SP]->(s2:SP)-[:CALL_SP]->(s3:SP)\n",
    "where s1<>s2 and s1<>s3 and s2<>s3\n",
    "return count(*)  as countsize\n",
    "\"\"\"\n",
    "df =graph.run(query).to_data_frame()\n",
    "print(df)\n",
    "\n",
    "print(\"Nested SP should have lower priority\")\n",
    "\n",
    "query = \"\"\"\n",
    "    MATCH r1=(s1:SP)-[:CALL_SP]->(s2:SP)\n",
    "    SET s2.priority = 1\n",
    "    \"\"\"\n",
    "print(\"            If an SP calls another SP, then the SP with dependencies should be worked on first\")\n",
    "graph.run(query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match(s:SP) \n",
    "where s.lpa_community_group is not null\n",
    "SET s.final_group = s.lpa_community_group\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#If a final group =1 counts, then put it in group=99991\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.final_group as final_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize=1\n",
    "\n",
    "with final_group_select\n",
    "match (s2:SP)\n",
    "where s2.final_group = final_group_select\n",
    "SET s2.final_group = 99991\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "#If a final group between 2 - 10 counts, then put it in group=99993\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.final_group as final_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize >= 2 and countsize <= 10 \n",
    "\n",
    "with final_group_select\n",
    "match (s2:SP)\n",
    "where s2.final_group = final_group_select\n",
    "SET s2.final_group = 99992\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "#If a final group between 11 - 19 counts, then put it in group=99993\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.final_group as final_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize > 10 and countsize <= 19\n",
    "\n",
    "with final_group_select\n",
    "match (s2:SP)\n",
    "where s2.final_group = final_group_select\n",
    "SET s2.final_group = 99993\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()\n",
    "\n",
    "\n",
    "#If a final group between 21 - 29 counts, then put it in group=99993\n",
    "\n",
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "with s.final_group as final_group_select, size(collect(s.SP_ID)) as countsize\n",
    "where countsize > 20 and countsize <= 29\n",
    "\n",
    "with final_group_select\n",
    "match (s2:SP)\n",
    "where s2.final_group = final_group_select\n",
    "SET s2.final_group = 99994\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>s.final_group</th>\n",
       "      <th>countsize</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>718</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>99991</td>\n",
       "      <td>242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>99992</td>\n",
       "      <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>99993</td>\n",
       "      <td>46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>99999</td>\n",
       "      <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>170</td>\n",
       "      <td>39</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>99995</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>412</td>\n",
       "      <td>33</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   s.final_group  countsize\n",
       "0              2        718\n",
       "1          99991        242\n",
       "2          99992         72\n",
       "3          99993         46\n",
       "4          99999         45\n",
       "5            170         39\n",
       "6          99995         35\n",
       "7            412         33"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "match (s:SP)\n",
    "return s.final_group, size(collect(s.SP_ID)) as countsize\n",
    "order by countsize desc\n",
    "\"\"\"\n",
    "graph.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1230</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count\n",
       "0   1230"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "exploratory_query = \"\"\"\n",
    "MATCH (n:SP)\n",
    "WITH n, n.final_group as final_group\n",
    "CALL apoc.create.addLabels(n, ['G_' + toString(final_group) ]) YIELD node\n",
    "RETURN count(n) as count\n",
    "\"\"\"\n",
    "graph.run(exploratory_query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [],
   "source": [
    "exploratory_query = \"\"\"\n",
    "MATCH (s:SP)-[r:RELY_ON]-(t:TABLE)\n",
    "RETURN s.SP_ID as SP_NAME, 'TABLE' as TYPE, t.TABLE_ID AS TABLE_NAME, s.final_group, s.lpa_community_group, s.louvain_community_group \n",
    "UNION \n",
    "OPTIONAL MATCH (s)-[r:RELY_ON]-(v:VIEW)\n",
    "RETURN s.SP_ID as SP_NAME, 'VIEW' as TYPE, v.VIEW_ID AS TABLE_NAME, s.final_group, s.lpa_community_group, s.louvain_community_group \n",
    "\"\"\"\n",
    "df =graph.run(exploratory_query).to_data_frame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>SP_NAME</th>\n",
       "      <th>TYPE</th>\n",
       "      <th>TABLE_NAME</th>\n",
       "      <th>s.final_group</th>\n",
       "      <th>s.lpa_community_group</th>\n",
       "      <th>s.louvain_community_group</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ANALYSE.ANFIELD_TO_INGESTION_SUMMARY</td>\n",
       "      <td>TABLE</td>\n",
       "      <td>ANALYSE.ANFIELD_MD_STANDARD_REWARD_TYPE</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ANALYSE.ANFIELD_TO_INGESTION_SUMMARY</td>\n",
       "      <td>TABLE</td>\n",
       "      <td>ANALYSE.ANFIELD_MD_LOCATION</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ANALYSE.ANFIELD_TO_INGESTION_SUMMARY</td>\n",
       "      <td>TABLE</td>\n",
       "      <td>PREPARE.ANFIELD_ALP_REWARD_SYNC_ISSUED</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ANALYSE.ANFIELD_TO_INGESTION_SUMMARY</td>\n",
       "      <td>TABLE</td>\n",
       "      <td>ANALYSE.ANFIELD_INGESTION_SUMMARY</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ANALYSE.ANFIELD_TO_INGESTION_SUMMARY</td>\n",
       "      <td>TABLE</td>\n",
       "      <td>ANALYSE.ANFIELD_MD_MEMBER_CORE</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>480.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6346</th>\n",
       "      <td>None</td>\n",
       "      <td>VIEW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1488.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6347</th>\n",
       "      <td>None</td>\n",
       "      <td>VIEW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1503.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6348</th>\n",
       "      <td>None</td>\n",
       "      <td>VIEW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1326.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6349</th>\n",
       "      <td>None</td>\n",
       "      <td>VIEW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1461.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6350</th>\n",
       "      <td>None</td>\n",
       "      <td>VIEW</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "      <td>1501.0</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>6351 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   SP_NAME   TYPE  \\\n",
       "0     ANALYSE.ANFIELD_TO_INGESTION_SUMMARY  TABLE   \n",
       "1     ANALYSE.ANFIELD_TO_INGESTION_SUMMARY  TABLE   \n",
       "2     ANALYSE.ANFIELD_TO_INGESTION_SUMMARY  TABLE   \n",
       "3     ANALYSE.ANFIELD_TO_INGESTION_SUMMARY  TABLE   \n",
       "4     ANALYSE.ANFIELD_TO_INGESTION_SUMMARY  TABLE   \n",
       "...                                    ...    ...   \n",
       "6346                                  None   VIEW   \n",
       "6347                                  None   VIEW   \n",
       "6348                                  None   VIEW   \n",
       "6349                                  None   VIEW   \n",
       "6350                                  None   VIEW   \n",
       "\n",
       "                                   TABLE_NAME  s.final_group  \\\n",
       "0     ANALYSE.ANFIELD_MD_STANDARD_REWARD_TYPE            2.0   \n",
       "1                 ANALYSE.ANFIELD_MD_LOCATION            2.0   \n",
       "2      PREPARE.ANFIELD_ALP_REWARD_SYNC_ISSUED            2.0   \n",
       "3           ANALYSE.ANFIELD_INGESTION_SUMMARY            2.0   \n",
       "4              ANALYSE.ANFIELD_MD_MEMBER_CORE            2.0   \n",
       "...                                       ...            ...   \n",
       "6346                                     None            NaN   \n",
       "6347                                     None            NaN   \n",
       "6348                                     None            NaN   \n",
       "6349                                     None            NaN   \n",
       "6350                                     None            NaN   \n",
       "\n",
       "      s.lpa_community_group  s.louvain_community_group  \n",
       "0                       2.0                      480.0  \n",
       "1                       2.0                      480.0  \n",
       "2                       2.0                      480.0  \n",
       "3                       2.0                      480.0  \n",
       "4                       2.0                      480.0  \n",
       "...                     ...                        ...  \n",
       "6346                 1488.0                        NaN  \n",
       "6347                 1503.0                        NaN  \n",
       "6348                 1326.0                        NaN  \n",
       "6349                 1461.0                        NaN  \n",
       "6350                 1501.0                        NaN  \n",
       "\n",
       "[6351 rows x 6 columns]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
